MicrochipTech/PIC32CXBZx_WBZx51_BLE_HANDOVER_CAN/apps/001_peripheral/firmware/src/packs/WBZ451H_DFP/component/fuses.h
#define FUSES_DEVCFG2_WDTWINSZ_WINSZ_25       (FUSES_DEVCFG2_WDTWINSZ_WINSZ_25_Val << FUSES_DEVCFG2_WDTWINSZ_Pos) /* (FUSES_DEVCFG2) Window size is 25% Position  */
#define FUSES_DEVCFG2_WDTWINSZ_WINSZ_37       (FUSES_DEVCFG2_WDTWINSZ_WINSZ_37_Val << FUSES_DEVCFG2_WDTWINSZ_Pos) /* (FUSES_DEVCFG2) Window size is 37.5% Position  */
#define FUSES_DEVCFG2_WDTWINSZ_WINSZ_50       (FUSES_DEVCFG2_WDTWINSZ_WINSZ_50_Val << FUSES_DEVCFG2_WDTWINSZ_Pos) /* (FUSES_DEVCFG2) Window size is 50% Position  */
#define FUSES_DEVCFG2_WDTWINSZ_WINSZ_75       (FUSES_DEVCFG2_WDTWINSZ_WINSZ_75_Val << FUSES_DEVCFG2_WDTWINSZ_Pos) /* (FUSES_DEVCFG2) Window size is 75% Position  */
#define FUSES_DEVCFG2_DMTCNT_Pos              _UINT32_(26)                                         /* (FUSES_DEVCFG2) Dead Man Timer Count Select Position */
#define FUSES_DEVCFG2_DMTCNT_Msk              (_UINT32_(0x1F) << FUSES_DEVCFG2_DMTCNT_Pos)         /* (FUSES_DEVCFG2) Dead Man Timer Count Select Mask */
#define FUSES_DEVCFG2_DMTCNT(value)           (FUSES_DEVCFG2_DMTCNT_Msk & (_UINT32_(value) << FUSES_DEVCFG2_DMTCNT_Pos)) /* Assigment of value for DMTCNT in the FUSES_DEVCFG2 register */
#define   FUSES_DEVCFG2_DMTCNT_DMT8_Val       _UINT32_(0x0)                                        /* (FUSES_DEVCFG2) 2^8 (256)  */
#define   FUSES_DEVCFG2_DMTCNT_DMT9_Val       _UINT32_(0x1)                                        /* (FUSES_DEVCFG2) 2^9 (512)  */
#define   FUSES_DEVCFG2_DMTCNT_DMT10_Val      _UINT32_(0x2)                                        /* (FUSES_DEVCFG2) 2^10 (1024)  */
#define   FUSES_DEVCFG2_DMTCNT_DMT11_Val      _UINT32_(0x3)                                        /* (FUSES_DEVCFG2) 2^11 (2048)  */
#define   FUSES_DEVCFG2_DMTCNT_DMT12_Val      _UINT32_(0x4)                                        /* (FUSES_DEVCFG2) 2^12 (4096)  */
#define   FUSES_DEVCFG2_DMTCNT_DMT13_Val      _UINT32_(0x5)                                        /* (FUSES_DEVCFG2) 2^13 (8192)  */
#define   FUSES_DEVCFG2_DMTCNT_DMT14_Val      _UINT32_(0x6)                                        /* (FUSES_DEVCFG2) 2^14 (16384)  */
#define   FUSES_DEVCFG2_DMTCNT_DMT15_Val      _UINT32_(0x7)                                        /* (FUSES_DEVCFG2) 2^15 (32768)  */
#define   FUSES_DEVCFG2_DMTCNT_DMT16_Val      _UINT32_(0x8)                                        /* (FUSES_DEVCFG2) 2^16 (65536)  */
#define   FUSES_DEVCFG2_DMTCNT_DMT17_Val      _UINT32_(0x9)                                        /* (FUSES_DEVCFG2) 2^17 (131072)  */
#define   FUSES_DEVCFG2_DMTCNT_DMT18_Val      _UINT32_(0xA)                                        /* (FUSES_DEVCFG2) 2^18 (262144)  */
#define   FUSES_DEVCFG2_DMTCNT_DMT19_Val      _UINT32_(0xB)                                        /* (FUSES_DEVCFG2) 2^19 (524288)  */
#define   FUSES_DEVCFG2_DMTCNT_DMT20_Val      _UINT32_(0xC)                                        /* (FUSES_DEVCFG2) 2^20 (1048576)  */
#define   FUSES_DEVCFG2_DMTCNT_DMT21_Val      _UINT32_(0xD)                                        /* (FUSES_DEVCFG2) 2^21 (2097152)  */
#define   FUSES_DEVCFG2_DMTCNT_DMT22_Val      _UINT32_(0xE)                                        /* (FUSES_DEVCFG2) 2^22 (4194304)  */
#define   FUSES_DEVCFG2_DMTCNT_DMT23_Val      _UINT32_(0xF)                                        /* (FUSES_DEVCFG2) 2^23 (8388608)  */
#define   FUSES_DEVCFG2_DMTCNT_DMT24_Val      _UINT32_(0x10)                                       /* (FUSES_DEVCFG2) 2^24 (16777216)  */
#define   FUSES_DEVCFG2_DMTCNT_DMT25_Val      _UINT32_(0x11)                                       /* (FUSES_DEVCFG2) 2^25 (33554432)  */
#define   FUSES_DEVCFG2_DMTCNT_DMT26_Val      _UINT32_(0x12)                                       /* (FUSES_DEVCFG2) 2^26 (67108864)  */
#define   FUSES_DEVCFG2_DMTCNT_DMT27_Val      _UINT32_(0x13)                                       /* (FUSES_DEVCFG2) 2^27 (134217728)  */
#define   FUSES_DEVCFG2_DMTCNT_DMT28_Val      _UINT32_(0x14)                                       /* (FUSES_DEVCFG2) 2^28 (268435456)  */
#define   FUSES_DEVCFG2_DMTCNT_DMT29_Val      _UINT32_(0x15)                                       /* (FUSES_DEVCFG2) 2^29 (536870912)  */
#define   FUSES_DEVCFG2_DMTCNT_DMT30_Val      _UINT32_(0x16)                                       /* (FUSES_DEVCFG2) 2^30 (1073741824)  */
#define   FUSES_DEVCFG2_DMTCNT_DMT31_Val      _UINT32_(0x17)                                       /* (FUSES_DEVCFG2) 2^31 (2147483648)  */
#define FUSES_DEVCFG2_DMTCNT_DMT8             (FUSES_DEVCFG2_DMTCNT_DMT8_Val << FUSES_DEVCFG2_DMTCNT_Pos) /* (FUSES_DEVCFG2) 2^8 (256) Position  */
#define FUSES_DEVCFG2_DMTCNT_DMT9             (FUSES_DEVCFG2_DMTCNT_DMT9_Val << FUSES_DEVCFG2_DMTCNT_Pos) /* (FUSES_DEVCFG2) 2^9 (512) Position  */
#define FUSES_DEVCFG2_DMTCNT_DMT10            (FUSES_DEVCFG2_DMTCNT_DMT10_Val << FUSES_DEVCFG2_DMTCNT_Pos) /* (FUSES_DEVCFG2) 2^10 (1024) Position  */
#define FUSES_DEVCFG2_DMTCNT_DMT11            (FUSES_DEVCFG2_DMTCNT_DMT11_Val << FUSES_DEVCFG2_DMTCNT_Pos) /* (FUSES_DEVCFG2) 2^11 (2048) Position  */
#define FUSES_DEVCFG2_DMTCNT_DMT12            (FUSES_DEVCFG2_DMTCNT_DMT12_Val << FUSES_DEVCFG2_DMTCNT_Pos) /* (FUSES_DEVCFG2) 2^12 (4096) Position  */
#define FUSES_DEVCFG2_DMTCNT_DMT13            (FUSES_DEVCFG2_DMTCNT_DMT13_Val << FUSES_DEVCFG2_DMTCNT_Pos) /* (FUSES_DEVCFG2) 2^13 (8192) Position  */
#define FUSES_DEVCFG2_DMTCNT_DMT14            (FUSES_DEVCFG2_DMTCNT_DMT14_Val << FUSES_DEVCFG2_DMTCNT_Pos) /* (FUSES_DEVCFG2) 2^14 (16384) Position  */
#define FUSES_DEVCFG2_DMTCNT_DMT15            (FUSES_DEVCFG2_DMTCNT_DMT15_Val << FUSES_DEVCFG2_DMTCNT_Pos) /* (FUSES_DEVCFG2) 2^15 (32768) Position  */
#define FUSES_DEVCFG2_DMTCNT_DMT16            (FUSES_DEVCFG2_DMTCNT_DMT16_Val << FUSES_DEVCFG2_DMTCNT_Pos) /* (FUSES_DEVCFG2) 2^16 (65536) Position  */
#define FUSES_DEVCFG2_DMTCNT_DMT17            (FUSES_DEVCFG2_DMTCNT_DMT17_Val << FUSES_DEVCFG2_DMTCNT_Pos) /* (FUSES_DEVCFG2) 2^17 (131072) Position  */
#define FUSES_DEVCFG2_DMTCNT_DMT18            (FUSES_DEVCFG2_DMTCNT_DMT18_Val << FUSES_DEVCFG2_DMTCNT_Pos) /* (FUSES_DEVCFG2) 2^18 (262144) Position  */
#define FUSES_DEVCFG2_DMTCNT_DMT19            (FUSES_DEVCFG2_DMTCNT_DMT19_Val << FUSES_DEVCFG2_DMTCNT_Pos) /* (FUSES_DEVCFG2) 2^19 (524288) Position  */
#define FUSES_DEVCFG2_DMTCNT_DMT20            (FUSES_DEVCFG2_DMTCNT_DMT20_Val << FUSES_DEVCFG2_DMTCNT_Pos) /* (FUSES_DEVCFG2) 2^20 (1048576) Position  */
#define FUSES_DEVCFG2_DMTCNT_DMT21            (FUSES_DEVCFG2_DMTCNT_DMT21_Val << FUSES_DEVCFG2_DMTCNT_Pos) /* (FUSES_DEVCFG2) 2^21 (2097152) Position  */
#define FUSES_DEVCFG2_DMTCNT_DMT22            (FUSES_DEVCFG2_DMTCNT_DMT22_Val << FUSES_DEVCFG2_DMTCNT_Pos) /* (FUSES_DEVCFG2) 2^22 (4194304) Position  */
#define FUSES_DEVCFG2_DMTCNT_DMT23            (FUSES_DEVCFG2_DMTCNT_DMT23_Val << FUSES_DEVCFG2_DMTCNT_Pos) /* (FUSES_DEVCFG2) 2^23 (8388608) Position  */
#define FUSES_DEVCFG2_DMTCNT_DMT24            (FUSES_DEVCFG2_DMTCNT_DMT24_Val << FUSES_DEVCFG2_DMTCNT_Pos) /* (FUSES_DEVCFG2) 2^24 (16777216) Position  */
#define FUSES_DEVCFG2_DMTCNT_DMT25            (FUSES_DEVCFG2_DMTCNT_DMT25_Val << FUSES_DEVCFG2_DMTCNT_Pos) /* (FUSES_DEVCFG2) 2^25 (33554432) Position  */
#define FUSES_DEVCFG2_DMTCNT_DMT26            (FUSES_DEVCFG2_DMTCNT_DMT26_Val << FUSES_DEVCFG2_DMTCNT_Pos) /* (FUSES_DEVCFG2) 2^26 (67108864) Position  */
#define FUSES_DEVCFG2_DMTCNT_DMT27            (FUSES_DEVCFG2_DMTCNT_DMT27_Val << FUSES_DEVCFG2_DMTCNT_Pos) /* (FUSES_DEVCFG2) 2^27 (134217728) Position  */
#define FUSES_DEVCFG2_DMTCNT_DMT28            (FUSES_DEVCFG2_DMTCNT_DMT28_Val << FUSES_DEVCFG2_DMTCNT_Pos) /* (FUSES_DEVCFG2) 2^28 (268435456) Position  */
#define FUSES_DEVCFG2_DMTCNT_DMT29            (FUSES_DEVCFG2_DMTCNT_DMT29_Val << FUSES_DEVCFG2_DMTCNT_Pos) /* (FUSES_DEVCFG2) 2^29 (536870912) Position  */
#define FUSES_DEVCFG2_DMTCNT_DMT30            (FUSES_DEVCFG2_DMTCNT_DMT30_Val << FUSES_DEVCFG2_DMTCNT_Pos) /* (FUSES_DEVCFG2) 2^30 (1073741824) Position  */
#define FUSES_DEVCFG2_DMTCNT_DMT31            (FUSES_DEVCFG2_DMTCNT_DMT31_Val << FUSES_DEVCFG2_DMTCNT_Pos) /* (FUSES_DEVCFG2) 2^31 (2147483648) Position  */
#define FUSES_DEVCFG2_DMTEN_Pos               _UINT32_(31)                                         /* (FUSES_DEVCFG2) Dead Man Timer Enable Position */
#define FUSES_DEVCFG2_DMTEN_Msk               (_UINT32_(0x1) << FUSES_DEVCFG2_DMTEN_Pos)           /* (FUSES_DEVCFG2) Dead Man Timer Enable Mask */
#define FUSES_DEVCFG2_DMTEN(value)            (FUSES_DEVCFG2_DMTEN_Msk & (_UINT32_(value) << FUSES_DEVCFG2_DMTEN_Pos)) /* Assigment of value for DMTEN in the FUSES_DEVCFG2 register */
#define   FUSES_DEVCFG2_DMTEN_ON_Val          _UINT32_(0x1)                                        /* (FUSES_DEVCFG2)   */
#define   FUSES_DEVCFG2_DMTEN_OFF_Val         _UINT32_(0x0)                                        /* (FUSES_DEVCFG2)   */
#define FUSES_DEVCFG2_DMTEN_ON                (FUSES_DEVCFG2_DMTEN_ON_Val << FUSES_DEVCFG2_DMTEN_Pos) /* (FUSES_DEVCFG2)  Position  */
#define FUSES_DEVCFG2_DMTEN_OFF               (FUSES_DEVCFG2_DMTEN_OFF_Val << FUSES_DEVCFG2_DMTEN_Pos) /* (FUSES_DEVCFG2)  Position  */
#define FUSES_DEVCFG2_Msk                     _UINT32_(0xFFFFFFBF)                                 /* (FUSES_DEVCFG2) Register Mask  */


/* -------- FUSES_DEVCFG1 : (FUSES Offset: 0x114) (R/W 32) USER Page CFGCON1 Fuses -------- */
#define FUSES_DEVCFG1_RESETVALUE              _UINT32_(0x1410443B)                                 /*  (FUSES_DEVCFG1) USER Page CFGCON1 Fuses  Reset Value */

