MicrochipTech/PIC32CXBZx_WBZx51_BLE_HANDOVER_CAN/apps/001_peripheral/firmware/src/packs/WBZ451H_DFP/component/fuses.h
#define FUSES_DEVCFG1_ICESEL_Pos              _UINT32_(3)                                          /* (FUSES_DEVCFG1) EMUC/EMUD Communication Channel Select Position */
#define FUSES_DEVCFG1_ICESEL_Msk              (_UINT32_(0x3) << FUSES_DEVCFG1_ICESEL_Pos)          /* (FUSES_DEVCFG1) EMUC/EMUD Communication Channel Select Mask */
#define FUSES_DEVCFG1_ICESEL(value)           (FUSES_DEVCFG1_ICESEL_Msk & (_UINT32_(value) << FUSES_DEVCFG1_ICESEL_Pos)) /* Assigment of value for ICESEL in the FUSES_DEVCFG1 register */
#define   FUSES_DEVCFG1_ICESEL_PGC4_PGD4_Val  _UINT32_(0x0)                                        /* (FUSES_DEVCFG1)   */
#define   FUSES_DEVCFG1_ICESEL_NOT_USED_Val   _UINT32_(0x1)                                        /* (FUSES_DEVCFG1)   */
#define   FUSES_DEVCFG1_ICESEL_PGC2_PGD2_Val  _UINT32_(0x2)                                        /* (FUSES_DEVCFG1)   */
#define   FUSES_DEVCFG1_ICESEL_PGC1_PGD1_Val  _UINT32_(0x3)                                        /* (FUSES_DEVCFG1)   */
#define FUSES_DEVCFG1_ICESEL_PGC4_PGD4        (FUSES_DEVCFG1_ICESEL_PGC4_PGD4_Val << FUSES_DEVCFG1_ICESEL_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_ICESEL_NOT_USED         (FUSES_DEVCFG1_ICESEL_NOT_USED_Val << FUSES_DEVCFG1_ICESEL_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_ICESEL_PGC2_PGD2        (FUSES_DEVCFG1_ICESEL_PGC2_PGD2_Val << FUSES_DEVCFG1_ICESEL_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_ICESEL_PGC1_PGD1        (FUSES_DEVCFG1_ICESEL_PGC1_PGD1_Val << FUSES_DEVCFG1_ICESEL_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_TRCEN_Pos               _UINT32_(5)                                          /* (FUSES_DEVCFG1) Trace Enable Position */
#define FUSES_DEVCFG1_TRCEN_Msk               (_UINT32_(0x1) << FUSES_DEVCFG1_TRCEN_Pos)           /* (FUSES_DEVCFG1) Trace Enable Mask */
#define FUSES_DEVCFG1_TRCEN(value)            (FUSES_DEVCFG1_TRCEN_Msk & (_UINT32_(value) << FUSES_DEVCFG1_TRCEN_Pos)) /* Assigment of value for TRCEN in the FUSES_DEVCFG1 register */
#define   FUSES_DEVCFG1_TRCEN_OFF_Val         _UINT32_(0x0)                                        /* (FUSES_DEVCFG1)   */
#define   FUSES_DEVCFG1_TRCEN_ON_Val          _UINT32_(0x1)                                        /* (FUSES_DEVCFG1)   */
#define FUSES_DEVCFG1_TRCEN_OFF               (FUSES_DEVCFG1_TRCEN_OFF_Val << FUSES_DEVCFG1_TRCEN_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_TRCEN_ON                (FUSES_DEVCFG1_TRCEN_ON_Val << FUSES_DEVCFG1_TRCEN_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_ZBTWKSYS_Pos            _UINT32_(7)                                          /* (FUSES_DEVCFG1) ZBT Subsystem External Wake-up source Position */
#define FUSES_DEVCFG1_ZBTWKSYS_Msk            (_UINT32_(0x1) << FUSES_DEVCFG1_ZBTWKSYS_Pos)        /* (FUSES_DEVCFG1) ZBT Subsystem External Wake-up source Mask */
#define FUSES_DEVCFG1_ZBTWKSYS(value)         (FUSES_DEVCFG1_ZBTWKSYS_Msk & (_UINT32_(value) << FUSES_DEVCFG1_ZBTWKSYS_Pos)) /* Assigment of value for ZBTWKSYS in the FUSES_DEVCFG1 register */
#define   FUSES_DEVCFG1_ZBTWKSYS_OFF_Val      _UINT32_(0x0)                                        /* (FUSES_DEVCFG1)   */
#define   FUSES_DEVCFG1_ZBTWKSYS_ON_Val       _UINT32_(0x1)                                        /* (FUSES_DEVCFG1)   */
#define FUSES_DEVCFG1_ZBTWKSYS_OFF            (FUSES_DEVCFG1_ZBTWKSYS_OFF_Val << FUSES_DEVCFG1_ZBTWKSYS_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_ZBTWKSYS_ON             (FUSES_DEVCFG1_ZBTWKSYS_ON_Val << FUSES_DEVCFG1_ZBTWKSYS_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_CMP0_OE_Pos             _UINT32_(8)                                          /* (FUSES_DEVCFG1) Analog Comparator-0 Output Enable Position */
#define FUSES_DEVCFG1_CMP0_OE_Msk             (_UINT32_(0x1) << FUSES_DEVCFG1_CMP0_OE_Pos)         /* (FUSES_DEVCFG1) Analog Comparator-0 Output Enable Mask */
#define FUSES_DEVCFG1_CMP0_OE(value)          (FUSES_DEVCFG1_CMP0_OE_Msk & (_UINT32_(value) << FUSES_DEVCFG1_CMP0_OE_Pos)) /* Assigment of value for CMP0_OE in the FUSES_DEVCFG1 register */
#define   FUSES_DEVCFG1_CMP0_OE_OFF_Val       _UINT32_(0x0)                                        /* (FUSES_DEVCFG1)   */
#define   FUSES_DEVCFG1_CMP0_OE_ON_Val        _UINT32_(0x1)                                        /* (FUSES_DEVCFG1)   */
#define FUSES_DEVCFG1_CMP0_OE_OFF             (FUSES_DEVCFG1_CMP0_OE_OFF_Val << FUSES_DEVCFG1_CMP0_OE_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_CMP0_OE_ON              (FUSES_DEVCFG1_CMP0_OE_ON_Val << FUSES_DEVCFG1_CMP0_OE_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_CMP1_OE_Pos             _UINT32_(9)                                          /* (FUSES_DEVCFG1) Analog Comparator-1 Output Enable Position */
#define FUSES_DEVCFG1_CMP1_OE_Msk             (_UINT32_(0x1) << FUSES_DEVCFG1_CMP1_OE_Pos)         /* (FUSES_DEVCFG1) Analog Comparator-1 Output Enable Mask */
#define FUSES_DEVCFG1_CMP1_OE(value)          (FUSES_DEVCFG1_CMP1_OE_Msk & (_UINT32_(value) << FUSES_DEVCFG1_CMP1_OE_Pos)) /* Assigment of value for CMP1_OE in the FUSES_DEVCFG1 register */
#define   FUSES_DEVCFG1_CMP1_OE_OFF_Val       _UINT32_(0x0)                                        /* (FUSES_DEVCFG1)   */
#define   FUSES_DEVCFG1_CMP1_OE_ON_Val        _UINT32_(0x1)                                        /* (FUSES_DEVCFG1)   */
#define FUSES_DEVCFG1_CMP1_OE_OFF             (FUSES_DEVCFG1_CMP1_OE_OFF_Val << FUSES_DEVCFG1_CMP1_OE_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_CMP1_OE_ON              (FUSES_DEVCFG1_CMP1_OE_ON_Val << FUSES_DEVCFG1_CMP1_OE_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_CLASSBDIS_Pos           _UINT32_(10)                                         /* (FUSES_DEVCFG1) Disable CLASSB Device Functionality Position */
#define FUSES_DEVCFG1_CLASSBDIS_Msk           (_UINT32_(0x1) << FUSES_DEVCFG1_CLASSBDIS_Pos)       /* (FUSES_DEVCFG1) Disable CLASSB Device Functionality Mask */
#define FUSES_DEVCFG1_CLASSBDIS(value)        (FUSES_DEVCFG1_CLASSBDIS_Msk & (_UINT32_(value) << FUSES_DEVCFG1_CLASSBDIS_Pos)) /* Assigment of value for CLASSBDIS in the FUSES_DEVCFG1 register */
#define   FUSES_DEVCFG1_CLASSBDIS_ON_Val      _UINT32_(0x0)                                        /* (FUSES_DEVCFG1)   */
#define   FUSES_DEVCFG1_CLASSBDIS_OFF_Val     _UINT32_(0x1)                                        /* (FUSES_DEVCFG1)   */
#define FUSES_DEVCFG1_CLASSBDIS_ON            (FUSES_DEVCFG1_CLASSBDIS_ON_Val << FUSES_DEVCFG1_CLASSBDIS_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_CLASSBDIS_OFF           (FUSES_DEVCFG1_CLASSBDIS_OFF_Val << FUSES_DEVCFG1_CLASSBDIS_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_SLRCTRL0_Pos            _UINT32_(11)                                         /* (FUSES_DEVCFG1) I2C Slew Rate Control for SERCOM0 Position */
#define FUSES_DEVCFG1_SLRCTRL0_Msk            (_UINT32_(0x1) << FUSES_DEVCFG1_SLRCTRL0_Pos)        /* (FUSES_DEVCFG1) I2C Slew Rate Control for SERCOM0 Mask */
#define FUSES_DEVCFG1_SLRCTRL0(value)         (FUSES_DEVCFG1_SLRCTRL0_Msk & (_UINT32_(value) << FUSES_DEVCFG1_SLRCTRL0_Pos)) /* Assigment of value for SLRCTRL0 in the FUSES_DEVCFG1 register */
#define   FUSES_DEVCFG1_SLRCTRL0_GPIO_Val     _UINT32_(0x0)                                        /* (FUSES_DEVCFG1)   */
#define   FUSES_DEVCFG1_SLRCTRL0_SERCOM_Val   _UINT32_(0x1)                                        /* (FUSES_DEVCFG1)   */
#define FUSES_DEVCFG1_SLRCTRL0_GPIO           (FUSES_DEVCFG1_SLRCTRL0_GPIO_Val << FUSES_DEVCFG1_SLRCTRL0_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_SLRCTRL0_SERCOM         (FUSES_DEVCFG1_SLRCTRL0_SERCOM_Val << FUSES_DEVCFG1_SLRCTRL0_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_SLRCTRL1_Pos            _UINT32_(12)                                         /* (FUSES_DEVCFG1) I2C Slew Rate Control for SERCOM1 Position */
#define FUSES_DEVCFG1_SLRCTRL1_Msk            (_UINT32_(0x1) << FUSES_DEVCFG1_SLRCTRL1_Pos)        /* (FUSES_DEVCFG1) I2C Slew Rate Control for SERCOM1 Mask */
#define FUSES_DEVCFG1_SLRCTRL1(value)         (FUSES_DEVCFG1_SLRCTRL1_Msk & (_UINT32_(value) << FUSES_DEVCFG1_SLRCTRL1_Pos)) /* Assigment of value for SLRCTRL1 in the FUSES_DEVCFG1 register */
#define   FUSES_DEVCFG1_SLRCTRL1_GPIO_Val     _UINT32_(0x0)                                        /* (FUSES_DEVCFG1)   */
#define   FUSES_DEVCFG1_SLRCTRL1_SERCOM_Val   _UINT32_(0x1)                                        /* (FUSES_DEVCFG1)   */
#define FUSES_DEVCFG1_SLRCTRL1_GPIO           (FUSES_DEVCFG1_SLRCTRL1_GPIO_Val << FUSES_DEVCFG1_SLRCTRL1_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_SLRCTRL1_SERCOM         (FUSES_DEVCFG1_SLRCTRL1_SERCOM_Val << FUSES_DEVCFG1_SLRCTRL1_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_SLRCTRL2_Pos            _UINT32_(13)                                         /* (FUSES_DEVCFG1) I2C Slew Rate Control for SERCOM2 Position */
#define FUSES_DEVCFG1_SLRCTRL2_Msk            (_UINT32_(0x1) << FUSES_DEVCFG1_SLRCTRL2_Pos)        /* (FUSES_DEVCFG1) I2C Slew Rate Control for SERCOM2 Mask */
#define FUSES_DEVCFG1_SLRCTRL2(value)         (FUSES_DEVCFG1_SLRCTRL2_Msk & (_UINT32_(value) << FUSES_DEVCFG1_SLRCTRL2_Pos)) /* Assigment of value for SLRCTRL2 in the FUSES_DEVCFG1 register */
#define   FUSES_DEVCFG1_SLRCTRL2_GPIO_Val     _UINT32_(0x0)                                        /* (FUSES_DEVCFG1)   */
#define   FUSES_DEVCFG1_SLRCTRL2_SERCOM_Val   _UINT32_(0x1)                                        /* (FUSES_DEVCFG1)   */
#define FUSES_DEVCFG1_SLRCTRL2_GPIO           (FUSES_DEVCFG1_SLRCTRL2_GPIO_Val << FUSES_DEVCFG1_SLRCTRL2_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_SLRCTRL2_SERCOM         (FUSES_DEVCFG1_SLRCTRL2_SERCOM_Val << FUSES_DEVCFG1_SLRCTRL2_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_SMCLR_Pos               _UINT32_(14)                                         /* (FUSES_DEVCFG1) Selects CRU handling of MCLR Control Position */
#define FUSES_DEVCFG1_SMCLR_Msk               (_UINT32_(0x1) << FUSES_DEVCFG1_SMCLR_Pos)           /* (FUSES_DEVCFG1) Selects CRU handling of MCLR Control Mask */
#define FUSES_DEVCFG1_SMCLR(value)            (FUSES_DEVCFG1_SMCLR_Msk & (_UINT32_(value) << FUSES_DEVCFG1_SMCLR_Pos)) /* Assigment of value for SMCLR in the FUSES_DEVCFG1 register */
#define   FUSES_DEVCFG1_SMCLR_NO_POR_Val      _UINT32_(0x1)                                        /* (FUSES_DEVCFG1)   */
#define   FUSES_DEVCFG1_SMCLR_FAUX_POR_Val    _UINT32_(0x0)                                        /* (FUSES_DEVCFG1)   */
#define FUSES_DEVCFG1_SMCLR_NO_POR            (FUSES_DEVCFG1_SMCLR_NO_POR_Val << FUSES_DEVCFG1_SMCLR_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_SMCLR_FAUX_POR          (FUSES_DEVCFG1_SMCLR_FAUX_POR_Val << FUSES_DEVCFG1_SMCLR_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_QSCHE_EN_Pos            _UINT32_(15)                                         /* (FUSES_DEVCFG1) QSPI Address Space Cache Attribute Position */
#define FUSES_DEVCFG1_QSCHE_EN_Msk            (_UINT32_(0x1) << FUSES_DEVCFG1_QSCHE_EN_Pos)        /* (FUSES_DEVCFG1) QSPI Address Space Cache Attribute Mask */
#define FUSES_DEVCFG1_QSCHE_EN(value)         (FUSES_DEVCFG1_QSCHE_EN_Msk & (_UINT32_(value) << FUSES_DEVCFG1_QSCHE_EN_Pos)) /* Assigment of value for QSCHE_EN in the FUSES_DEVCFG1 register */
#define   FUSES_DEVCFG1_QSCHE_EN_OFF_Val      _UINT32_(0x0)                                        /* (FUSES_DEVCFG1)   */
#define   FUSES_DEVCFG1_QSCHE_EN_ON_Val       _UINT32_(0x1)                                        /* (FUSES_DEVCFG1)   */
#define FUSES_DEVCFG1_QSCHE_EN_OFF            (FUSES_DEVCFG1_QSCHE_EN_OFF_Val << FUSES_DEVCFG1_QSCHE_EN_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_QSCHE_EN_ON             (FUSES_DEVCFG1_QSCHE_EN_ON_Val << FUSES_DEVCFG1_QSCHE_EN_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_QSPI_HSEN_Pos           _UINT32_(16)                                         /* (FUSES_DEVCFG1) QSPI Direct (High Speed) Pin Enable Position */
#define FUSES_DEVCFG1_QSPI_HSEN_Msk           (_UINT32_(0x1) << FUSES_DEVCFG1_QSPI_HSEN_Pos)       /* (FUSES_DEVCFG1) QSPI Direct (High Speed) Pin Enable Mask */
#define FUSES_DEVCFG1_QSPI_HSEN(value)        (FUSES_DEVCFG1_QSPI_HSEN_Msk & (_UINT32_(value) << FUSES_DEVCFG1_QSPI_HSEN_Pos)) /* Assigment of value for QSPI_HSEN in the FUSES_DEVCFG1 register */
#define   FUSES_DEVCFG1_QSPI_HSEN_PPS_Val     _UINT32_(0x0)                                        /* (FUSES_DEVCFG1)   */
#define   FUSES_DEVCFG1_QSPI_HSEN_DIRECT_Val  _UINT32_(0x1)                                        /* (FUSES_DEVCFG1)   */
#define FUSES_DEVCFG1_QSPI_HSEN_PPS           (FUSES_DEVCFG1_QSPI_HSEN_PPS_Val << FUSES_DEVCFG1_QSPI_HSEN_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_QSPI_HSEN_DIRECT        (FUSES_DEVCFG1_QSPI_HSEN_DIRECT_Val << FUSES_DEVCFG1_QSPI_HSEN_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_SCOM0_HSEN_Pos          _UINT32_(17)                                         /* (FUSES_DEVCFG1) SERCOM0 Direct (High Speed) Pin Enable Position */
#define FUSES_DEVCFG1_SCOM0_HSEN_Msk          (_UINT32_(0x1) << FUSES_DEVCFG1_SCOM0_HSEN_Pos)      /* (FUSES_DEVCFG1) SERCOM0 Direct (High Speed) Pin Enable Mask */
#define FUSES_DEVCFG1_SCOM0_HSEN(value)       (FUSES_DEVCFG1_SCOM0_HSEN_Msk & (_UINT32_(value) << FUSES_DEVCFG1_SCOM0_HSEN_Pos)) /* Assigment of value for SCOM0_HSEN in the FUSES_DEVCFG1 register */
#define   FUSES_DEVCFG1_SCOM0_HSEN_PPS_Val    _UINT32_(0x0)                                        /* (FUSES_DEVCFG1)   */
#define   FUSES_DEVCFG1_SCOM0_HSEN_DIRECT_Val _UINT32_(0x1)                                        /* (FUSES_DEVCFG1)   */
#define FUSES_DEVCFG1_SCOM0_HSEN_PPS          (FUSES_DEVCFG1_SCOM0_HSEN_PPS_Val << FUSES_DEVCFG1_SCOM0_HSEN_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_SCOM0_HSEN_DIRECT       (FUSES_DEVCFG1_SCOM0_HSEN_DIRECT_Val << FUSES_DEVCFG1_SCOM0_HSEN_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_SCOM1_HSEN_Pos          _UINT32_(18)                                         /* (FUSES_DEVCFG1) SERCOM1 Direct (High Speed) Pin Enable Position */
#define FUSES_DEVCFG1_SCOM1_HSEN_Msk          (_UINT32_(0x1) << FUSES_DEVCFG1_SCOM1_HSEN_Pos)      /* (FUSES_DEVCFG1) SERCOM1 Direct (High Speed) Pin Enable Mask */
#define FUSES_DEVCFG1_SCOM1_HSEN(value)       (FUSES_DEVCFG1_SCOM1_HSEN_Msk & (_UINT32_(value) << FUSES_DEVCFG1_SCOM1_HSEN_Pos)) /* Assigment of value for SCOM1_HSEN in the FUSES_DEVCFG1 register */
#define   FUSES_DEVCFG1_SCOM1_HSEN_PPS_Val    _UINT32_(0x0)                                        /* (FUSES_DEVCFG1)   */
#define   FUSES_DEVCFG1_SCOM1_HSEN_DIRECT_Val _UINT32_(0x1)                                        /* (FUSES_DEVCFG1)   */
#define FUSES_DEVCFG1_SCOM1_HSEN_PPS          (FUSES_DEVCFG1_SCOM1_HSEN_PPS_Val << FUSES_DEVCFG1_SCOM1_HSEN_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_SCOM1_HSEN_DIRECT       (FUSES_DEVCFG1_SCOM1_HSEN_DIRECT_Val << FUSES_DEVCFG1_SCOM1_HSEN_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_SCOM2_HSEN_Pos          _UINT32_(19)                                         /* (FUSES_DEVCFG1) SERCOM2 Direct (High Speed) Pin Enable Position */
#define FUSES_DEVCFG1_SCOM2_HSEN_Msk          (_UINT32_(0x1) << FUSES_DEVCFG1_SCOM2_HSEN_Pos)      /* (FUSES_DEVCFG1) SERCOM2 Direct (High Speed) Pin Enable Mask */
#define FUSES_DEVCFG1_SCOM2_HSEN(value)       (FUSES_DEVCFG1_SCOM2_HSEN_Msk & (_UINT32_(value) << FUSES_DEVCFG1_SCOM2_HSEN_Pos)) /* Assigment of value for SCOM2_HSEN in the FUSES_DEVCFG1 register */
#define   FUSES_DEVCFG1_SCOM2_HSEN_PPS_Val    _UINT32_(0x0)                                        /* (FUSES_DEVCFG1)   */
#define   FUSES_DEVCFG1_SCOM2_HSEN_DIRECT_Val _UINT32_(0x1)                                        /* (FUSES_DEVCFG1)   */
#define FUSES_DEVCFG1_SCOM2_HSEN_PPS          (FUSES_DEVCFG1_SCOM2_HSEN_PPS_Val << FUSES_DEVCFG1_SCOM2_HSEN_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_SCOM2_HSEN_DIRECT       (FUSES_DEVCFG1_SCOM2_HSEN_DIRECT_Val << FUSES_DEVCFG1_SCOM2_HSEN_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_CCL_OE_Pos              _UINT32_(20)                                         /* (FUSES_DEVCFG1) CCL Pads (via PPS) Output Enable Position */
#define FUSES_DEVCFG1_CCL_OE_Msk              (_UINT32_(0x1) << FUSES_DEVCFG1_CCL_OE_Pos)          /* (FUSES_DEVCFG1) CCL Pads (via PPS) Output Enable Mask */
#define FUSES_DEVCFG1_CCL_OE(value)           (FUSES_DEVCFG1_CCL_OE_Msk & (_UINT32_(value) << FUSES_DEVCFG1_CCL_OE_Pos)) /* Assigment of value for CCL_OE in the FUSES_DEVCFG1 register */
#define   FUSES_DEVCFG1_CCL_OE_OFF_Val        _UINT32_(0x0)                                        /* (FUSES_DEVCFG1)   */
#define   FUSES_DEVCFG1_CCL_OE_ON_Val         _UINT32_(0x1)                                        /* (FUSES_DEVCFG1)   */
#define FUSES_DEVCFG1_CCL_OE_OFF              (FUSES_DEVCFG1_CCL_OE_OFF_Val << FUSES_DEVCFG1_CCL_OE_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_CCL_OE_ON               (FUSES_DEVCFG1_CCL_OE_ON_Val << FUSES_DEVCFG1_CCL_OE_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_I2CDSEL0_Pos            _UINT32_(21)                                         /* (FUSES_DEVCFG1) I2C Delay Select for SERCOM0 Position */
#define FUSES_DEVCFG1_I2CDSEL0_Msk            (_UINT32_(0x1) << FUSES_DEVCFG1_I2CDSEL0_Pos)        /* (FUSES_DEVCFG1) I2C Delay Select for SERCOM0 Mask */
#define FUSES_DEVCFG1_I2CDSEL0(value)         (FUSES_DEVCFG1_I2CDSEL0_Msk & (_UINT32_(value) << FUSES_DEVCFG1_I2CDSEL0_Pos)) /* Assigment of value for I2CDSEL0 in the FUSES_DEVCFG1 register */
#define   FUSES_DEVCFG1_I2CDSEL0_OFF_Val      _UINT32_(0x0)                                        /* (FUSES_DEVCFG1)   */
#define   FUSES_DEVCFG1_I2CDSEL0_ON_Val       _UINT32_(0x1)                                        /* (FUSES_DEVCFG1)   */
#define FUSES_DEVCFG1_I2CDSEL0_OFF            (FUSES_DEVCFG1_I2CDSEL0_OFF_Val << FUSES_DEVCFG1_I2CDSEL0_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_I2CDSEL0_ON             (FUSES_DEVCFG1_I2CDSEL0_ON_Val << FUSES_DEVCFG1_I2CDSEL0_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_I2CDSEL1_Pos            _UINT32_(22)                                         /* (FUSES_DEVCFG1) I2C Delay Select for SERCOM1 Position */
#define FUSES_DEVCFG1_I2CDSEL1_Msk            (_UINT32_(0x1) << FUSES_DEVCFG1_I2CDSEL1_Pos)        /* (FUSES_DEVCFG1) I2C Delay Select for SERCOM1 Mask */
#define FUSES_DEVCFG1_I2CDSEL1(value)         (FUSES_DEVCFG1_I2CDSEL1_Msk & (_UINT32_(value) << FUSES_DEVCFG1_I2CDSEL1_Pos)) /* Assigment of value for I2CDSEL1 in the FUSES_DEVCFG1 register */
#define   FUSES_DEVCFG1_I2CDSEL1_OFF_Val      _UINT32_(0x0)                                        /* (FUSES_DEVCFG1)   */
#define   FUSES_DEVCFG1_I2CDSEL1_ON_Val       _UINT32_(0x1)                                        /* (FUSES_DEVCFG1)   */
#define FUSES_DEVCFG1_I2CDSEL1_OFF            (FUSES_DEVCFG1_I2CDSEL1_OFF_Val << FUSES_DEVCFG1_I2CDSEL1_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_I2CDSEL1_ON             (FUSES_DEVCFG1_I2CDSEL1_ON_Val << FUSES_DEVCFG1_I2CDSEL1_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_I2CDSEL2_Pos            _UINT32_(23)                                         /* (FUSES_DEVCFG1) I2C Delay Select for SERCOM2 Position */
#define FUSES_DEVCFG1_I2CDSEL2_Msk            (_UINT32_(0x1) << FUSES_DEVCFG1_I2CDSEL2_Pos)        /* (FUSES_DEVCFG1) I2C Delay Select for SERCOM2 Mask */
#define FUSES_DEVCFG1_I2CDSEL2(value)         (FUSES_DEVCFG1_I2CDSEL2_Msk & (_UINT32_(value) << FUSES_DEVCFG1_I2CDSEL2_Pos)) /* Assigment of value for I2CDSEL2 in the FUSES_DEVCFG1 register */
#define   FUSES_DEVCFG1_I2CDSEL2_OFF_Val      _UINT32_(0x0)                                        /* (FUSES_DEVCFG1)   */
#define   FUSES_DEVCFG1_I2CDSEL2_ON_Val       _UINT32_(0x1)                                        /* (FUSES_DEVCFG1)   */
#define FUSES_DEVCFG1_I2CDSEL2_OFF            (FUSES_DEVCFG1_I2CDSEL2_OFF_Val << FUSES_DEVCFG1_I2CDSEL2_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_I2CDSEL2_ON             (FUSES_DEVCFG1_I2CDSEL2_ON_Val << FUSES_DEVCFG1_I2CDSEL2_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_WDTPSS_Pos              _UINT32_(24)                                         /* (FUSES_DEVCFG1) Watchdog Timer Post-scale Select Sleep Position */
#define FUSES_DEVCFG1_WDTPSS_Msk              (_UINT32_(0x1F) << FUSES_DEVCFG1_WDTPSS_Pos)         /* (FUSES_DEVCFG1) Watchdog Timer Post-scale Select Sleep Mask */
#define FUSES_DEVCFG1_WDTPSS(value)           (FUSES_DEVCFG1_WDTPSS_Msk & (_UINT32_(value) << FUSES_DEVCFG1_WDTPSS_Pos)) /* Assigment of value for WDTPSS in the FUSES_DEVCFG1 register */
#define   FUSES_DEVCFG1_WDTPSS_PSS1_Val       _UINT32_(0x0)                                        /* (FUSES_DEVCFG1) 1:1  */
#define   FUSES_DEVCFG1_WDTPSS_PSS2_Val       _UINT32_(0x1)                                        /* (FUSES_DEVCFG1) 1:2  */
#define   FUSES_DEVCFG1_WDTPSS_PSS4_Val       _UINT32_(0x2)                                        /* (FUSES_DEVCFG1) 1:4  */
#define   FUSES_DEVCFG1_WDTPSS_PSS8_Val       _UINT32_(0x3)                                        /* (FUSES_DEVCFG1) 1:8  */
#define   FUSES_DEVCFG1_WDTPSS_PSS16_Val      _UINT32_(0x4)                                        /* (FUSES_DEVCFG1) 1:16  */
#define   FUSES_DEVCFG1_WDTPSS_PSS32_Val      _UINT32_(0x5)                                        /* (FUSES_DEVCFG1) 1:32  */
#define   FUSES_DEVCFG1_WDTPSS_PSS64_Val      _UINT32_(0x6)                                        /* (FUSES_DEVCFG1) 1:64  */
#define   FUSES_DEVCFG1_WDTPSS_PSS128_Val     _UINT32_(0x7)                                        /* (FUSES_DEVCFG1) 1:128  */
#define   FUSES_DEVCFG1_WDTPSS_PSS256_Val     _UINT32_(0x8)                                        /* (FUSES_DEVCFG1) 1:256  */
#define   FUSES_DEVCFG1_WDTPSS_PSS512_Val     _UINT32_(0x9)                                        /* (FUSES_DEVCFG1) 1:512  */
#define   FUSES_DEVCFG1_WDTPSS_PSS1024_Val    _UINT32_(0xA)                                        /* (FUSES_DEVCFG1) 1:1024  */
#define   FUSES_DEVCFG1_WDTPSS_PSS2048_Val    _UINT32_(0xB)                                        /* (FUSES_DEVCFG1) 1:2048  */
#define   FUSES_DEVCFG1_WDTPSS_PSS4096_Val    _UINT32_(0xC)                                        /* (FUSES_DEVCFG1) 1:4096  */
#define   FUSES_DEVCFG1_WDTPSS_PSS8192_Val    _UINT32_(0xD)                                        /* (FUSES_DEVCFG1) 1:8192  */
#define   FUSES_DEVCFG1_WDTPSS_PSS16384_Val   _UINT32_(0xE)                                        /* (FUSES_DEVCFG1) 1:16384  */
#define   FUSES_DEVCFG1_WDTPSS_PSS32768_Val   _UINT32_(0xF)                                        /* (FUSES_DEVCFG1) 1:32768  */
#define   FUSES_DEVCFG1_WDTPSS_PSS65536_Val   _UINT32_(0x10)                                       /* (FUSES_DEVCFG1) 1:65536  */
#define   FUSES_DEVCFG1_WDTPSS_PSS131072_Val  _UINT32_(0x11)                                       /* (FUSES_DEVCFG1) 1:131072  */
#define   FUSES_DEVCFG1_WDTPSS_PSS262144_Val  _UINT32_(0x12)                                       /* (FUSES_DEVCFG1) 1:262144  */
#define   FUSES_DEVCFG1_WDTPSS_PSS524288_Val  _UINT32_(0x13)                                       /* (FUSES_DEVCFG1) 1:524288  */
#define   FUSES_DEVCFG1_WDTPSS_PSS1048576_Val _UINT32_(0x14)                                       /* (FUSES_DEVCFG1) 1:1048576  */
#define FUSES_DEVCFG1_WDTPSS_PSS1             (FUSES_DEVCFG1_WDTPSS_PSS1_Val << FUSES_DEVCFG1_WDTPSS_Pos) /* (FUSES_DEVCFG1) 1:1 Position  */
#define FUSES_DEVCFG1_WDTPSS_PSS2             (FUSES_DEVCFG1_WDTPSS_PSS2_Val << FUSES_DEVCFG1_WDTPSS_Pos) /* (FUSES_DEVCFG1) 1:2 Position  */
