MicrochipTech/PIC32CXBZx_WBZx51_BLE_HANDOVER_CAN/apps/001_peripheral/firmware/src/packs/WBZ451H_DFP/component/fuses.h
#define FUSES_DEVCFG1_WDTPSS_PSS4             (FUSES_DEVCFG1_WDTPSS_PSS4_Val << FUSES_DEVCFG1_WDTPSS_Pos) /* (FUSES_DEVCFG1) 1:4 Position  */
#define FUSES_DEVCFG1_WDTPSS_PSS8             (FUSES_DEVCFG1_WDTPSS_PSS8_Val << FUSES_DEVCFG1_WDTPSS_Pos) /* (FUSES_DEVCFG1) 1:8 Position  */
#define FUSES_DEVCFG1_WDTPSS_PSS16            (FUSES_DEVCFG1_WDTPSS_PSS16_Val << FUSES_DEVCFG1_WDTPSS_Pos) /* (FUSES_DEVCFG1) 1:16 Position  */
#define FUSES_DEVCFG1_WDTPSS_PSS32            (FUSES_DEVCFG1_WDTPSS_PSS32_Val << FUSES_DEVCFG1_WDTPSS_Pos) /* (FUSES_DEVCFG1) 1:32 Position  */
#define FUSES_DEVCFG1_WDTPSS_PSS64            (FUSES_DEVCFG1_WDTPSS_PSS64_Val << FUSES_DEVCFG1_WDTPSS_Pos) /* (FUSES_DEVCFG1) 1:64 Position  */
#define FUSES_DEVCFG1_WDTPSS_PSS128           (FUSES_DEVCFG1_WDTPSS_PSS128_Val << FUSES_DEVCFG1_WDTPSS_Pos) /* (FUSES_DEVCFG1) 1:128 Position  */
#define FUSES_DEVCFG1_WDTPSS_PSS256           (FUSES_DEVCFG1_WDTPSS_PSS256_Val << FUSES_DEVCFG1_WDTPSS_Pos) /* (FUSES_DEVCFG1) 1:256 Position  */
#define FUSES_DEVCFG1_WDTPSS_PSS512           (FUSES_DEVCFG1_WDTPSS_PSS512_Val << FUSES_DEVCFG1_WDTPSS_Pos) /* (FUSES_DEVCFG1) 1:512 Position  */
#define FUSES_DEVCFG1_WDTPSS_PSS1024          (FUSES_DEVCFG1_WDTPSS_PSS1024_Val << FUSES_DEVCFG1_WDTPSS_Pos) /* (FUSES_DEVCFG1) 1:1024 Position  */
#define FUSES_DEVCFG1_WDTPSS_PSS2048          (FUSES_DEVCFG1_WDTPSS_PSS2048_Val << FUSES_DEVCFG1_WDTPSS_Pos) /* (FUSES_DEVCFG1) 1:2048 Position  */
#define FUSES_DEVCFG1_WDTPSS_PSS4096          (FUSES_DEVCFG1_WDTPSS_PSS4096_Val << FUSES_DEVCFG1_WDTPSS_Pos) /* (FUSES_DEVCFG1) 1:4096 Position  */
#define FUSES_DEVCFG1_WDTPSS_PSS8192          (FUSES_DEVCFG1_WDTPSS_PSS8192_Val << FUSES_DEVCFG1_WDTPSS_Pos) /* (FUSES_DEVCFG1) 1:8192 Position  */
#define FUSES_DEVCFG1_WDTPSS_PSS16384         (FUSES_DEVCFG1_WDTPSS_PSS16384_Val << FUSES_DEVCFG1_WDTPSS_Pos) /* (FUSES_DEVCFG1) 1:16384 Position  */
#define FUSES_DEVCFG1_WDTPSS_PSS32768         (FUSES_DEVCFG1_WDTPSS_PSS32768_Val << FUSES_DEVCFG1_WDTPSS_Pos) /* (FUSES_DEVCFG1) 1:32768 Position  */
#define FUSES_DEVCFG1_WDTPSS_PSS65536         (FUSES_DEVCFG1_WDTPSS_PSS65536_Val << FUSES_DEVCFG1_WDTPSS_Pos) /* (FUSES_DEVCFG1) 1:65536 Position  */
#define FUSES_DEVCFG1_WDTPSS_PSS131072        (FUSES_DEVCFG1_WDTPSS_PSS131072_Val << FUSES_DEVCFG1_WDTPSS_Pos) /* (FUSES_DEVCFG1) 1:131072 Position  */
#define FUSES_DEVCFG1_WDTPSS_PSS262144        (FUSES_DEVCFG1_WDTPSS_PSS262144_Val << FUSES_DEVCFG1_WDTPSS_Pos) /* (FUSES_DEVCFG1) 1:262144 Position  */
#define FUSES_DEVCFG1_WDTPSS_PSS524288        (FUSES_DEVCFG1_WDTPSS_PSS524288_Val << FUSES_DEVCFG1_WDTPSS_Pos) /* (FUSES_DEVCFG1) 1:524288 Position  */
#define FUSES_DEVCFG1_WDTPSS_PSS1048576       (FUSES_DEVCFG1_WDTPSS_PSS1048576_Val << FUSES_DEVCFG1_WDTPSS_Pos) /* (FUSES_DEVCFG1) 1:1048576 Position  */
#define FUSES_DEVCFG1_QSPIDDRM_Pos            _UINT32_(29)                                         /* (FUSES_DEVCFG1) QSPI DDR Mode Clock Enable Position */
#define FUSES_DEVCFG1_QSPIDDRM_Msk            (_UINT32_(0x1) << FUSES_DEVCFG1_QSPIDDRM_Pos)        /* (FUSES_DEVCFG1) QSPI DDR Mode Clock Enable Mask */
#define FUSES_DEVCFG1_QSPIDDRM(value)         (FUSES_DEVCFG1_QSPIDDRM_Msk & (_UINT32_(value) << FUSES_DEVCFG1_QSPIDDRM_Pos)) /* Assigment of value for QSPIDDRM in the FUSES_DEVCFG1 register */
#define   FUSES_DEVCFG1_QSPIDDRM_ON_Val       _UINT32_(0x1)                                        /* (FUSES_DEVCFG1)   */
#define   FUSES_DEVCFG1_QSPIDDRM_OFF_Val      _UINT32_(0x0)                                        /* (FUSES_DEVCFG1)   */
#define FUSES_DEVCFG1_QSPIDDRM_ON             (FUSES_DEVCFG1_QSPIDDRM_ON_Val << FUSES_DEVCFG1_QSPIDDRM_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_QSPIDDRM_OFF            (FUSES_DEVCFG1_QSPIDDRM_OFF_Val << FUSES_DEVCFG1_QSPIDDRM_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_CLKZBREF_Pos            _UINT32_(30)                                         /* (FUSES_DEVCFG1) External Reference Clock ZB Enable Position */
#define FUSES_DEVCFG1_CLKZBREF_Msk            (_UINT32_(0x1) << FUSES_DEVCFG1_CLKZBREF_Pos)        /* (FUSES_DEVCFG1) External Reference Clock ZB Enable Mask */
#define FUSES_DEVCFG1_CLKZBREF(value)         (FUSES_DEVCFG1_CLKZBREF_Msk & (_UINT32_(value) << FUSES_DEVCFG1_CLKZBREF_Pos)) /* Assigment of value for CLKZBREF in the FUSES_DEVCFG1 register */
#define   FUSES_DEVCFG1_CLKZBREF_ON_Val       _UINT32_(0x1)                                        /* (FUSES_DEVCFG1)   */
#define   FUSES_DEVCFG1_CLKZBREF_OFF_Val      _UINT32_(0x0)                                        /* (FUSES_DEVCFG1)   */
#define FUSES_DEVCFG1_CLKZBREF_ON             (FUSES_DEVCFG1_CLKZBREF_ON_Val << FUSES_DEVCFG1_CLKZBREF_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_CLKZBREF_OFF            (FUSES_DEVCFG1_CLKZBREF_OFF_Val << FUSES_DEVCFG1_CLKZBREF_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_Msk                     _UINT32_(0x7FFFFFB8)                                 /* (FUSES_DEVCFG1) Register Mask  */

#define FUSES_DEVCFG1_SLRCTRL_Pos             _UINT32_(11)                                         /* (FUSES_DEVCFG1 Position) I2C Slew Rate Control for SERCOMx */
#define FUSES_DEVCFG1_SLRCTRL_Msk             (_UINT32_(0x7) << FUSES_DEVCFG1_SLRCTRL_Pos)         /* (FUSES_DEVCFG1 Mask) SLRCTRL */
#define FUSES_DEVCFG1_SLRCTRL(value)          (FUSES_DEVCFG1_SLRCTRL_Msk & (_UINT32_(value) << FUSES_DEVCFG1_SLRCTRL_Pos)) 
#define FUSES_DEVCFG1_I2CDSEL_Pos             _UINT32_(21)                                         /* (FUSES_DEVCFG1 Position) I2C Delay Select for SERCOMx */
#define FUSES_DEVCFG1_I2CDSEL_Msk             (_UINT32_(0x7) << FUSES_DEVCFG1_I2CDSEL_Pos)         /* (FUSES_DEVCFG1 Mask) I2CDSEL */
#define FUSES_DEVCFG1_I2CDSEL(value)          (FUSES_DEVCFG1_I2CDSEL_Msk & (_UINT32_(value) << FUSES_DEVCFG1_I2CDSEL_Pos)) 

/* -------- FUSES_DEVCFG0 : (FUSES Offset: 0x118) (R/W 32) USER Page CFGCON0 Fuses -------- */
#define FUSES_DEVCFG0_RESETVALUE              _UINT32_(0x7100000B)                                 /*  (FUSES_DEVCFG0) USER Page CFGCON0 Fuses  Reset Value */

