MicrochipTech/PIC32CXBZx_WBZx51_BLE_HANDOVER_CAN/apps/001_peripheral/firmware/src/packs/WBZ451H_DFP/component/fuses.h
#define FUSES_DEVCFG0_TDOEN_Pos               _UINT32_(0)                                          /* (FUSES_DEVCFG0) TDO enable for 2-wire JTAG Position */
#define FUSES_DEVCFG0_TDOEN_Msk               (_UINT32_(0x1) << FUSES_DEVCFG0_TDOEN_Pos)           /* (FUSES_DEVCFG0) TDO enable for 2-wire JTAG Mask */
#define FUSES_DEVCFG0_TDOEN(value)            (FUSES_DEVCFG0_TDOEN_Msk & (_UINT32_(value) << FUSES_DEVCFG0_TDOEN_Pos)) /* Assigment of value for TDOEN in the FUSES_DEVCFG0 register */
#define   FUSES_DEVCFG0_TDOEN_OFF_Val         _UINT32_(0x0)                                        /* (FUSES_DEVCFG0)   */
#define   FUSES_DEVCFG0_TDOEN_ON_Val          _UINT32_(0x1)                                        /* (FUSES_DEVCFG0)   */
#define FUSES_DEVCFG0_TDOEN_OFF               (FUSES_DEVCFG0_TDOEN_OFF_Val << FUSES_DEVCFG0_TDOEN_Pos) /* (FUSES_DEVCFG0)  Position  */
#define FUSES_DEVCFG0_TDOEN_ON                (FUSES_DEVCFG0_TDOEN_ON_Val << FUSES_DEVCFG0_TDOEN_Pos) /* (FUSES_DEVCFG0)  Position  */
#define FUSES_DEVCFG0_SWOEN_Pos               _UINT32_(1)                                          /* (FUSES_DEVCFG0) SWO enable on 2-wire debug interface Position */
#define FUSES_DEVCFG0_SWOEN_Msk               (_UINT32_(0x1) << FUSES_DEVCFG0_SWOEN_Pos)           /* (FUSES_DEVCFG0) SWO enable on 2-wire debug interface Mask */
#define FUSES_DEVCFG0_SWOEN(value)            (FUSES_DEVCFG0_SWOEN_Msk & (_UINT32_(value) << FUSES_DEVCFG0_SWOEN_Pos)) /* Assigment of value for SWOEN in the FUSES_DEVCFG0 register */
#define   FUSES_DEVCFG0_SWOEN_OFF_Val         _UINT32_(0x0)                                        /* (FUSES_DEVCFG0)   */
#define   FUSES_DEVCFG0_SWOEN_ON_Val          _UINT32_(0x1)                                        /* (FUSES_DEVCFG0)   */
#define FUSES_DEVCFG0_SWOEN_OFF               (FUSES_DEVCFG0_SWOEN_OFF_Val << FUSES_DEVCFG0_SWOEN_Pos) /* (FUSES_DEVCFG0)  Position  */
#define FUSES_DEVCFG0_SWOEN_ON                (FUSES_DEVCFG0_SWOEN_ON_Val << FUSES_DEVCFG0_SWOEN_Pos) /* (FUSES_DEVCFG0)  Position  */
#define FUSES_DEVCFG0_TROEN_Pos               _UINT32_(2)                                          /* (FUSES_DEVCFG0) Trace Output Enable Position */
#define FUSES_DEVCFG0_TROEN_Msk               (_UINT32_(0x1) << FUSES_DEVCFG0_TROEN_Pos)           /* (FUSES_DEVCFG0) Trace Output Enable Mask */
#define FUSES_DEVCFG0_TROEN(value)            (FUSES_DEVCFG0_TROEN_Msk & (_UINT32_(value) << FUSES_DEVCFG0_TROEN_Pos)) /* Assigment of value for TROEN in the FUSES_DEVCFG0 register */
#define   FUSES_DEVCFG0_TROEN_OFF_Val         _UINT32_(0x0)                                        /* (FUSES_DEVCFG0)   */
#define   FUSES_DEVCFG0_TROEN_ON_Val          _UINT32_(0x1)                                        /* (FUSES_DEVCFG0)   */
#define FUSES_DEVCFG0_TROEN_OFF               (FUSES_DEVCFG0_TROEN_OFF_Val << FUSES_DEVCFG0_TROEN_Pos) /* (FUSES_DEVCFG0)  Position  */
#define FUSES_DEVCFG0_TROEN_ON                (FUSES_DEVCFG0_TROEN_ON_Val << FUSES_DEVCFG0_TROEN_Pos) /* (FUSES_DEVCFG0)  Position  */
#define FUSES_DEVCFG0_ADCPOVR_Pos             _UINT32_(4)                                          /* (FUSES_DEVCFG0) ADC Charge Pump Override Position */
#define FUSES_DEVCFG0_ADCPOVR_Msk             (_UINT32_(0x1) << FUSES_DEVCFG0_ADCPOVR_Pos)         /* (FUSES_DEVCFG0) ADC Charge Pump Override Mask */
#define FUSES_DEVCFG0_ADCPOVR(value)          (FUSES_DEVCFG0_ADCPOVR_Msk & (_UINT32_(value) << FUSES_DEVCFG0_ADCPOVR_Pos)) /* Assigment of value for ADCPOVR in the FUSES_DEVCFG0 register */
#define   FUSES_DEVCFG0_ADCPOVR_HW_Val        _UINT32_(0x0)                                        /* (FUSES_DEVCFG0)   */
#define   FUSES_DEVCFG0_ADCPOVR_SW_Val        _UINT32_(0x1)                                        /* (FUSES_DEVCFG0)   */
#define FUSES_DEVCFG0_ADCPOVR_HW              (FUSES_DEVCFG0_ADCPOVR_HW_Val << FUSES_DEVCFG0_ADCPOVR_Pos) /* (FUSES_DEVCFG0)  Position  */
#define FUSES_DEVCFG0_ADCPOVR_SW              (FUSES_DEVCFG0_ADCPOVR_SW_Val << FUSES_DEVCFG0_ADCPOVR_Pos) /* (FUSES_DEVCFG0)  Position  */
#define FUSES_DEVCFG0_ACCMP1_ALTEN_Pos        _UINT32_(6)                                          /* (FUSES_DEVCFG0) AC CMP1 Alternate Enable Position */
#define FUSES_DEVCFG0_ACCMP1_ALTEN_Msk        (_UINT32_(0x1) << FUSES_DEVCFG0_ACCMP1_ALTEN_Pos)    /* (FUSES_DEVCFG0) AC CMP1 Alternate Enable Mask */
#define FUSES_DEVCFG0_ACCMP1_ALTEN(value)     (FUSES_DEVCFG0_ACCMP1_ALTEN_Msk & (_UINT32_(value) << FUSES_DEVCFG0_ACCMP1_ALTEN_Pos)) /* Assigment of value for ACCMP1_ALTEN in the FUSES_DEVCFG0 register */
#define   FUSES_DEVCFG0_ACCMP1_ALTEN_PA6_Val  _UINT32_(0x1)                                        /* (FUSES_DEVCFG0)   */
#define   FUSES_DEVCFG0_ACCMP1_ALTEN_PA1_Val  _UINT32_(0x0)                                        /* (FUSES_DEVCFG0)   */
#define FUSES_DEVCFG0_ACCMP1_ALTEN_PA6        (FUSES_DEVCFG0_ACCMP1_ALTEN_PA6_Val << FUSES_DEVCFG0_ACCMP1_ALTEN_Pos) /* (FUSES_DEVCFG0)  Position  */
#define FUSES_DEVCFG0_ACCMP1_ALTEN_PA1        (FUSES_DEVCFG0_ACCMP1_ALTEN_PA1_Val << FUSES_DEVCFG0_ACCMP1_ALTEN_Pos) /* (FUSES_DEVCFG0)  Position  */
#define FUSES_DEVCFG0_CPENFILT_Pos            _UINT32_(7)                                          /* (FUSES_DEVCFG0) ADC CP Filter Enable Position */
#define FUSES_DEVCFG0_CPENFILT_Msk            (_UINT32_(0x1) << FUSES_DEVCFG0_CPENFILT_Pos)        /* (FUSES_DEVCFG0) ADC CP Filter Enable Mask */
#define FUSES_DEVCFG0_CPENFILT(value)         (FUSES_DEVCFG0_CPENFILT_Msk & (_UINT32_(value) << FUSES_DEVCFG0_CPENFILT_Pos)) /* Assigment of value for CPENFILT in the FUSES_DEVCFG0 register */
#define   FUSES_DEVCFG0_CPENFILT_OFF_Val      _UINT32_(0x0)                                        /* (FUSES_DEVCFG0)   */
#define   FUSES_DEVCFG0_CPENFILT_ON_Val       _UINT32_(0x1)                                        /* (FUSES_DEVCFG0)   */
#define FUSES_DEVCFG0_CPENFILT_OFF            (FUSES_DEVCFG0_CPENFILT_OFF_Val << FUSES_DEVCFG0_CPENFILT_Pos) /* (FUSES_DEVCFG0)  Position  */
#define FUSES_DEVCFG0_CPENFILT_ON             (FUSES_DEVCFG0_CPENFILT_ON_Val << FUSES_DEVCFG0_CPENFILT_Pos) /* (FUSES_DEVCFG0)  Position  */
#define FUSES_DEVCFG0_RTCIN0_ALTEN_Pos        _UINT32_(8)                                          /* (FUSES_DEVCFG0) RTCIN0 Alternate Enable Position */
#define FUSES_DEVCFG0_RTCIN0_ALTEN_Msk        (_UINT32_(0x1) << FUSES_DEVCFG0_RTCIN0_ALTEN_Pos)    /* (FUSES_DEVCFG0) RTCIN0 Alternate Enable Mask */
#define FUSES_DEVCFG0_RTCIN0_ALTEN(value)     (FUSES_DEVCFG0_RTCIN0_ALTEN_Msk & (_UINT32_(value) << FUSES_DEVCFG0_RTCIN0_ALTEN_Pos)) /* Assigment of value for RTCIN0_ALTEN in the FUSES_DEVCFG0 register */
#define   FUSES_DEVCFG0_RTCIN0_ALTEN_PA3_Val  _UINT32_(0x0)                                        /* (FUSES_DEVCFG0)   */
#define   FUSES_DEVCFG0_RTCIN0_ALTEN_PA9_Val  _UINT32_(0x1)                                        /* (FUSES_DEVCFG0)   */
#define FUSES_DEVCFG0_RTCIN0_ALTEN_PA3        (FUSES_DEVCFG0_RTCIN0_ALTEN_PA3_Val << FUSES_DEVCFG0_RTCIN0_ALTEN_Pos) /* (FUSES_DEVCFG0)  Position  */
#define FUSES_DEVCFG0_RTCIN0_ALTEN_PA9        (FUSES_DEVCFG0_RTCIN0_ALTEN_PA9_Val << FUSES_DEVCFG0_RTCIN0_ALTEN_Pos) /* (FUSES_DEVCFG0)  Position  */
#define FUSES_DEVCFG0_RTCOUT_ALTEN_Pos        _UINT32_(9)                                          /* (FUSES_DEVCFG0) RTCOUT Alternate Enable Position */
#define FUSES_DEVCFG0_RTCOUT_ALTEN_Msk        (_UINT32_(0x1) << FUSES_DEVCFG0_RTCOUT_ALTEN_Pos)    /* (FUSES_DEVCFG0) RTCOUT Alternate Enable Mask */
#define FUSES_DEVCFG0_RTCOUT_ALTEN(value)     (FUSES_DEVCFG0_RTCOUT_ALTEN_Msk & (_UINT32_(value) << FUSES_DEVCFG0_RTCOUT_ALTEN_Pos)) /* Assigment of value for RTCOUT_ALTEN in the FUSES_DEVCFG0 register */
#define   FUSES_DEVCFG0_RTCOUT_ALTEN_PA4_Val  _UINT32_(0x0)                                        /* (FUSES_DEVCFG0)   */
#define   FUSES_DEVCFG0_RTCOUT_ALTEN_PA10_Val _UINT32_(0x1)                                        /* (FUSES_DEVCFG0)   */
#define FUSES_DEVCFG0_RTCOUT_ALTEN_PA4        (FUSES_DEVCFG0_RTCOUT_ALTEN_PA4_Val << FUSES_DEVCFG0_RTCOUT_ALTEN_Pos) /* (FUSES_DEVCFG0)  Position  */
#define FUSES_DEVCFG0_RTCOUT_ALTEN_PA10       (FUSES_DEVCFG0_RTCOUT_ALTEN_PA10_Val << FUSES_DEVCFG0_RTCOUT_ALTEN_Pos) /* (FUSES_DEVCFG0)  Position  */
#define FUSES_DEVCFG0_VBCMODE_Pos             _UINT32_(16)                                         /* (FUSES_DEVCFG0) VBC Operating Mode Position */
#define FUSES_DEVCFG0_VBCMODE_Msk             (_UINT32_(0x1) << FUSES_DEVCFG0_VBCMODE_Pos)         /* (FUSES_DEVCFG0) VBC Operating Mode Mask */
#define FUSES_DEVCFG0_VBCMODE(value)          (FUSES_DEVCFG0_VBCMODE_Msk & (_UINT32_(value) << FUSES_DEVCFG0_VBCMODE_Pos)) /* Assigment of value for VBCMODE in the FUSES_DEVCFG0 register */
#define   FUSES_DEVCFG0_VBCMODE_DIRECT_Val    _UINT32_(0x0)                                        /* (FUSES_DEVCFG0)   */
#define   FUSES_DEVCFG0_VBCMODE_INDIR_Val     _UINT32_(0x1)                                        /* (FUSES_DEVCFG0)   */
#define FUSES_DEVCFG0_VBCMODE_DIRECT          (FUSES_DEVCFG0_VBCMODE_DIRECT_Val << FUSES_DEVCFG0_VBCMODE_Pos) /* (FUSES_DEVCFG0)  Position  */
#define FUSES_DEVCFG0_VBCMODE_INDIR           (FUSES_DEVCFG0_VBCMODE_INDIR_Val << FUSES_DEVCFG0_VBCMODE_Pos) /* (FUSES_DEVCFG0)  Position  */
#define FUSES_DEVCFG0_SMBUSEN0_Pos            _UINT32_(17)                                         /* (FUSES_DEVCFG0) SMBus Enable for SERCOM0 Position */
#define FUSES_DEVCFG0_SMBUSEN0_Msk            (_UINT32_(0x1) << FUSES_DEVCFG0_SMBUSEN0_Pos)        /* (FUSES_DEVCFG0) SMBus Enable for SERCOM0 Mask */
#define FUSES_DEVCFG0_SMBUSEN0(value)         (FUSES_DEVCFG0_SMBUSEN0_Msk & (_UINT32_(value) << FUSES_DEVCFG0_SMBUSEN0_Pos)) /* Assigment of value for SMBUSEN0 in the FUSES_DEVCFG0 register */
#define   FUSES_DEVCFG0_SMBUSEN0_OFF_Val      _UINT32_(0x0)                                        /* (FUSES_DEVCFG0)   */
#define   FUSES_DEVCFG0_SMBUSEN0_ON_Val       _UINT32_(0x1)                                        /* (FUSES_DEVCFG0)   */
#define FUSES_DEVCFG0_SMBUSEN0_OFF            (FUSES_DEVCFG0_SMBUSEN0_OFF_Val << FUSES_DEVCFG0_SMBUSEN0_Pos) /* (FUSES_DEVCFG0)  Position  */
#define FUSES_DEVCFG0_SMBUSEN0_ON             (FUSES_DEVCFG0_SMBUSEN0_ON_Val << FUSES_DEVCFG0_SMBUSEN0_Pos) /* (FUSES_DEVCFG0)  Position  */
#define FUSES_DEVCFG0_SMBUSEN1_Pos            _UINT32_(18)                                         /* (FUSES_DEVCFG0) SMBus Enable for SERCOM1 Position */
#define FUSES_DEVCFG0_SMBUSEN1_Msk            (_UINT32_(0x1) << FUSES_DEVCFG0_SMBUSEN1_Pos)        /* (FUSES_DEVCFG0) SMBus Enable for SERCOM1 Mask */
#define FUSES_DEVCFG0_SMBUSEN1(value)         (FUSES_DEVCFG0_SMBUSEN1_Msk & (_UINT32_(value) << FUSES_DEVCFG0_SMBUSEN1_Pos)) /* Assigment of value for SMBUSEN1 in the FUSES_DEVCFG0 register */
#define   FUSES_DEVCFG0_SMBUSEN1_OFF_Val      _UINT32_(0x0)                                        /* (FUSES_DEVCFG0)   */
#define   FUSES_DEVCFG0_SMBUSEN1_ON_Val       _UINT32_(0x1)                                        /* (FUSES_DEVCFG0)   */
#define FUSES_DEVCFG0_SMBUSEN1_OFF            (FUSES_DEVCFG0_SMBUSEN1_OFF_Val << FUSES_DEVCFG0_SMBUSEN1_Pos) /* (FUSES_DEVCFG0)  Position  */
#define FUSES_DEVCFG0_SMBUSEN1_ON             (FUSES_DEVCFG0_SMBUSEN1_ON_Val << FUSES_DEVCFG0_SMBUSEN1_Pos) /* (FUSES_DEVCFG0)  Position  */
#define FUSES_DEVCFG0_SMBUSEN2_Pos            _UINT32_(19)                                         /* (FUSES_DEVCFG0) SMBus Enable for SERCOM2 Position */
#define FUSES_DEVCFG0_SMBUSEN2_Msk            (_UINT32_(0x1) << FUSES_DEVCFG0_SMBUSEN2_Pos)        /* (FUSES_DEVCFG0) SMBus Enable for SERCOM2 Mask */
#define FUSES_DEVCFG0_SMBUSEN2(value)         (FUSES_DEVCFG0_SMBUSEN2_Msk & (_UINT32_(value) << FUSES_DEVCFG0_SMBUSEN2_Pos)) /* Assigment of value for SMBUSEN2 in the FUSES_DEVCFG0 register */
#define   FUSES_DEVCFG0_SMBUSEN2_OFF_Val      _UINT32_(0x0)                                        /* (FUSES_DEVCFG0)   */
#define   FUSES_DEVCFG0_SMBUSEN2_ON_Val       _UINT32_(0x1)                                        /* (FUSES_DEVCFG0)   */
#define FUSES_DEVCFG0_SMBUSEN2_OFF            (FUSES_DEVCFG0_SMBUSEN2_OFF_Val << FUSES_DEVCFG0_SMBUSEN2_Pos) /* (FUSES_DEVCFG0)  Position  */
#define FUSES_DEVCFG0_SMBUSEN2_ON             (FUSES_DEVCFG0_SMBUSEN2_ON_Val << FUSES_DEVCFG0_SMBUSEN2_Pos) /* (FUSES_DEVCFG0)  Position  */
#define FUSES_DEVCFG0_HPLUGDIS_Pos            _UINT32_(20)                                         /* (FUSES_DEVCFG0) Hot Plugging Disable Position */
#define FUSES_DEVCFG0_HPLUGDIS_Msk            (_UINT32_(0x1) << FUSES_DEVCFG0_HPLUGDIS_Pos)        /* (FUSES_DEVCFG0) Hot Plugging Disable Mask */
#define FUSES_DEVCFG0_HPLUGDIS(value)         (FUSES_DEVCFG0_HPLUGDIS_Msk & (_UINT32_(value) << FUSES_DEVCFG0_HPLUGDIS_Pos)) /* Assigment of value for HPLUGDIS in the FUSES_DEVCFG0 register */
#define   FUSES_DEVCFG0_HPLUGDIS_OFF_Val      _UINT32_(0x0)                                        /* (FUSES_DEVCFG0)   */
#define   FUSES_DEVCFG0_HPLUGDIS_ON_Val       _UINT32_(0x1)                                        /* (FUSES_DEVCFG0)   */
#define FUSES_DEVCFG0_HPLUGDIS_OFF            (FUSES_DEVCFG0_HPLUGDIS_OFF_Val << FUSES_DEVCFG0_HPLUGDIS_Pos) /* (FUSES_DEVCFG0)  Position  */
#define FUSES_DEVCFG0_HPLUGDIS_ON             (FUSES_DEVCFG0_HPLUGDIS_ON_Val << FUSES_DEVCFG0_HPLUGDIS_Pos) /* (FUSES_DEVCFG0)  Position  */
#define FUSES_DEVCFG0_SLRTEN0_Pos             _UINT32_(21)                                         /* (FUSES_DEVCFG0) SLRT Enable for SERCOM0 Position */
#define FUSES_DEVCFG0_SLRTEN0_Msk             (_UINT32_(0x1) << FUSES_DEVCFG0_SLRTEN0_Pos)         /* (FUSES_DEVCFG0) SLRT Enable for SERCOM0 Mask */
#define FUSES_DEVCFG0_SLRTEN0(value)          (FUSES_DEVCFG0_SLRTEN0_Msk & (_UINT32_(value) << FUSES_DEVCFG0_SLRTEN0_Pos)) /* Assigment of value for SLRTEN0 in the FUSES_DEVCFG0 register */
#define   FUSES_DEVCFG0_SLRTEN0_OFF_Val       _UINT32_(0x0)                                        /* (FUSES_DEVCFG0)   */
#define   FUSES_DEVCFG0_SLRTEN0_ON_Val        _UINT32_(0x1)                                        /* (FUSES_DEVCFG0)   */
#define FUSES_DEVCFG0_SLRTEN0_OFF             (FUSES_DEVCFG0_SLRTEN0_OFF_Val << FUSES_DEVCFG0_SLRTEN0_Pos) /* (FUSES_DEVCFG0)  Position  */
#define FUSES_DEVCFG0_SLRTEN0_ON              (FUSES_DEVCFG0_SLRTEN0_ON_Val << FUSES_DEVCFG0_SLRTEN0_Pos) /* (FUSES_DEVCFG0)  Position  */
#define FUSES_DEVCFG0_SLRTEN1_Pos             _UINT32_(22)                                         /* (FUSES_DEVCFG0) SLRT Enable for SERCOM1 Position */
#define FUSES_DEVCFG0_SLRTEN1_Msk             (_UINT32_(0x1) << FUSES_DEVCFG0_SLRTEN1_Pos)         /* (FUSES_DEVCFG0) SLRT Enable for SERCOM1 Mask */
#define FUSES_DEVCFG0_SLRTEN1(value)          (FUSES_DEVCFG0_SLRTEN1_Msk & (_UINT32_(value) << FUSES_DEVCFG0_SLRTEN1_Pos)) /* Assigment of value for SLRTEN1 in the FUSES_DEVCFG0 register */
#define   FUSES_DEVCFG0_SLRTEN1_OFF_Val       _UINT32_(0x0)                                        /* (FUSES_DEVCFG0)   */
#define   FUSES_DEVCFG0_SLRTEN1_ON_Val        _UINT32_(0x1)                                        /* (FUSES_DEVCFG0)   */
#define FUSES_DEVCFG0_SLRTEN1_OFF             (FUSES_DEVCFG0_SLRTEN1_OFF_Val << FUSES_DEVCFG0_SLRTEN1_Pos) /* (FUSES_DEVCFG0)  Position  */
#define FUSES_DEVCFG0_SLRTEN1_ON              (FUSES_DEVCFG0_SLRTEN1_ON_Val << FUSES_DEVCFG0_SLRTEN1_Pos) /* (FUSES_DEVCFG0)  Position  */
#define FUSES_DEVCFG0_SLRTEN2_Pos             _UINT32_(23)                                         /* (FUSES_DEVCFG0) SLRT Enable for SERCOM2 Position */
#define FUSES_DEVCFG0_SLRTEN2_Msk             (_UINT32_(0x1) << FUSES_DEVCFG0_SLRTEN2_Pos)         /* (FUSES_DEVCFG0) SLRT Enable for SERCOM2 Mask */
#define FUSES_DEVCFG0_SLRTEN2(value)          (FUSES_DEVCFG0_SLRTEN2_Msk & (_UINT32_(value) << FUSES_DEVCFG0_SLRTEN2_Pos)) /* Assigment of value for SLRTEN2 in the FUSES_DEVCFG0 register */
#define   FUSES_DEVCFG0_SLRTEN2_OFF_Val       _UINT32_(0x0)                                        /* (FUSES_DEVCFG0)   */
#define   FUSES_DEVCFG0_SLRTEN2_ON_Val        _UINT32_(0x1)                                        /* (FUSES_DEVCFG0)   */
#define FUSES_DEVCFG0_SLRTEN2_OFF             (FUSES_DEVCFG0_SLRTEN2_OFF_Val << FUSES_DEVCFG0_SLRTEN2_Pos) /* (FUSES_DEVCFG0)  Position  */
#define FUSES_DEVCFG0_SLRTEN2_ON              (FUSES_DEVCFG0_SLRTEN2_ON_Val << FUSES_DEVCFG0_SLRTEN2_Pos) /* (FUSES_DEVCFG0)  Position  */
#define FUSES_DEVCFG0_PCM_Pos                 _UINT32_(24)                                         /* (FUSES_DEVCFG0) PCHE I/D Cacheable Mode Position */
#define FUSES_DEVCFG0_PCM_Msk                 (_UINT32_(0x1) << FUSES_DEVCFG0_PCM_Pos)             /* (FUSES_DEVCFG0) PCHE I/D Cacheable Mode Mask */
#define FUSES_DEVCFG0_PCM(value)              (FUSES_DEVCFG0_PCM_Msk & (_UINT32_(value) << FUSES_DEVCFG0_PCM_Pos)) /* Assigment of value for PCM in the FUSES_DEVCFG0 register */
#define   FUSES_DEVCFG0_PCM_CPU_Val           _UINT32_(0x0)                                        /* (FUSES_DEVCFG0)   */
#define   FUSES_DEVCFG0_PCM_SFR_Val           _UINT32_(0x1)                                        /* (FUSES_DEVCFG0)   */
#define FUSES_DEVCFG0_PCM_CPU                 (FUSES_DEVCFG0_PCM_CPU_Val << FUSES_DEVCFG0_PCM_Pos) /* (FUSES_DEVCFG0)  Position  */
#define FUSES_DEVCFG0_PCM_SFR                 (FUSES_DEVCFG0_PCM_SFR_Val << FUSES_DEVCFG0_PCM_Pos) /* (FUSES_DEVCFG0)  Position  */
#define FUSES_DEVCFG0_INT0E_Pos               _UINT32_(25)                                         /* (FUSES_DEVCFG0) INT0 Enable Position */
#define FUSES_DEVCFG0_INT0E_Msk               (_UINT32_(0x1) << FUSES_DEVCFG0_INT0E_Pos)           /* (FUSES_DEVCFG0) INT0 Enable Mask */
#define FUSES_DEVCFG0_INT0E(value)            (FUSES_DEVCFG0_INT0E_Msk & (_UINT32_(value) << FUSES_DEVCFG0_INT0E_Pos)) /* Assigment of value for INT0E in the FUSES_DEVCFG0 register */
#define   FUSES_DEVCFG0_INT0E_OFF_Val         _UINT32_(0x0)                                        /* (FUSES_DEVCFG0)   */
#define   FUSES_DEVCFG0_INT0E_ON_Val          _UINT32_(0x1)                                        /* (FUSES_DEVCFG0)   */
#define FUSES_DEVCFG0_INT0E_OFF               (FUSES_DEVCFG0_INT0E_OFF_Val << FUSES_DEVCFG0_INT0E_Pos) /* (FUSES_DEVCFG0)  Position  */
#define FUSES_DEVCFG0_INT0E_ON                (FUSES_DEVCFG0_INT0E_ON_Val << FUSES_DEVCFG0_INT0E_Pos) /* (FUSES_DEVCFG0)  Position  */
#define FUSES_DEVCFG0_INT0P_Pos               _UINT32_(26)                                         /* (FUSES_DEVCFG0) INT0P Polarity Position */
#define FUSES_DEVCFG0_INT0P_Msk               (_UINT32_(0x1) << FUSES_DEVCFG0_INT0P_Pos)           /* (FUSES_DEVCFG0) INT0P Polarity Mask */
#define FUSES_DEVCFG0_INT0P(value)            (FUSES_DEVCFG0_INT0P_Msk & (_UINT32_(value) << FUSES_DEVCFG0_INT0P_Pos)) /* Assigment of value for INT0P in the FUSES_DEVCFG0 register */
#define   FUSES_DEVCFG0_INT0P_NEG_Val         _UINT32_(0x0)                                        /* (FUSES_DEVCFG0)   */
#define   FUSES_DEVCFG0_INT0P_POS_Val         _UINT32_(0x1)                                        /* (FUSES_DEVCFG0)   */
#define FUSES_DEVCFG0_INT0P_NEG               (FUSES_DEVCFG0_INT0P_NEG_Val << FUSES_DEVCFG0_INT0P_Pos) /* (FUSES_DEVCFG0)  Position  */
#define FUSES_DEVCFG0_INT0P_POS               (FUSES_DEVCFG0_INT0P_POS_Val << FUSES_DEVCFG0_INT0P_Pos) /* (FUSES_DEVCFG0)  Position  */
#define FUSES_DEVCFG0_FECCCON_Pos             _UINT32_(28)                                         /* (FUSES_DEVCFG0) Flash ECC Control Position */
#define FUSES_DEVCFG0_FECCCON_Msk             (_UINT32_(0x3) << FUSES_DEVCFG0_FECCCON_Pos)         /* (FUSES_DEVCFG0) Flash ECC Control Mask */
#define FUSES_DEVCFG0_FECCCON(value)          (FUSES_DEVCFG0_FECCCON_Msk & (_UINT32_(value) << FUSES_DEVCFG0_FECCCON_Pos)) /* Assigment of value for FECCCON in the FUSES_DEVCFG0 register */
#define   FUSES_DEVCFG0_FECCCON_ON_Val        _UINT32_(0x0)                                        /* (FUSES_DEVCFG0)   */
#define   FUSES_DEVCFG0_FECCCON_DYNAMIC_Val   _UINT32_(0x1)                                        /* (FUSES_DEVCFG0)   */
#define   FUSES_DEVCFG0_FECCCON_OFF_Val       _UINT32_(0x3)                                        /* (FUSES_DEVCFG0)   */
#define FUSES_DEVCFG0_FECCCON_ON              (FUSES_DEVCFG0_FECCCON_ON_Val << FUSES_DEVCFG0_FECCCON_Pos) /* (FUSES_DEVCFG0)  Position  */
#define FUSES_DEVCFG0_FECCCON_DYNAMIC         (FUSES_DEVCFG0_FECCCON_DYNAMIC_Val << FUSES_DEVCFG0_FECCCON_Pos) /* (FUSES_DEVCFG0)  Position  */
#define FUSES_DEVCFG0_FECCCON_OFF             (FUSES_DEVCFG0_FECCCON_OFF_Val << FUSES_DEVCFG0_FECCCON_Pos) /* (FUSES_DEVCFG0)  Position  */
#define FUSES_DEVCFG0_FRECCDIS_Pos            _UINT32_(30)                                         /* (FUSES_DEVCFG0) Flex RAM ECC Control Position */
#define FUSES_DEVCFG0_FRECCDIS_Msk            (_UINT32_(0x1) << FUSES_DEVCFG0_FRECCDIS_Pos)        /* (FUSES_DEVCFG0) Flex RAM ECC Control Mask */
#define FUSES_DEVCFG0_FRECCDIS(value)         (FUSES_DEVCFG0_FRECCDIS_Msk & (_UINT32_(value) << FUSES_DEVCFG0_FRECCDIS_Pos)) /* Assigment of value for FRECCDIS in the FUSES_DEVCFG0 register */
#define   FUSES_DEVCFG0_FRECCDIS_OFF_Val      _UINT32_(0x1)                                        /* (FUSES_DEVCFG0)   */
#define   FUSES_DEVCFG0_FRECCDIS_ON_Val       _UINT32_(0x0)                                        /* (FUSES_DEVCFG0)   */
#define FUSES_DEVCFG0_FRECCDIS_OFF            (FUSES_DEVCFG0_FRECCDIS_OFF_Val << FUSES_DEVCFG0_FRECCDIS_Pos) /* (FUSES_DEVCFG0)  Position  */
#define FUSES_DEVCFG0_FRECCDIS_ON             (FUSES_DEVCFG0_FRECCDIS_ON_Val << FUSES_DEVCFG0_FRECCDIS_Pos) /* (FUSES_DEVCFG0)  Position  */
#define FUSES_DEVCFG0_Msk                     _UINT32_(0x77FF03D7)                                 /* (FUSES_DEVCFG0) Register Mask  */

#define FUSES_DEVCFG0_SMBUSEN_Pos             _UINT32_(17)                                         /* (FUSES_DEVCFG0 Position) SMBus Enable for SERCOMx */
#define FUSES_DEVCFG0_SMBUSEN_Msk             (_UINT32_(0x7) << FUSES_DEVCFG0_SMBUSEN_Pos)         /* (FUSES_DEVCFG0 Mask) SMBUSEN */
#define FUSES_DEVCFG0_SMBUSEN(value)          (FUSES_DEVCFG0_SMBUSEN_Msk & (_UINT32_(value) << FUSES_DEVCFG0_SMBUSEN_Pos)) 
#define FUSES_DEVCFG0_SLRTEN_Pos              _UINT32_(21)                                         /* (FUSES_DEVCFG0 Position) SLRT Enable for SERCOMx */
#define FUSES_DEVCFG0_SLRTEN_Msk              (_UINT32_(0x7) << FUSES_DEVCFG0_SLRTEN_Pos)          /* (FUSES_DEVCFG0 Mask) SLRTEN */
#define FUSES_DEVCFG0_SLRTEN(value)           (FUSES_DEVCFG0_SLRTEN_Msk & (_UINT32_(value) << FUSES_DEVCFG0_SLRTEN_Pos)) 

/* -------- FUSES_FBCFG0 : (FUSES Offset: 0x11C) (R/W 32) NVR BCFG User Configuration Area -------- */
#define FUSES_FBCFG0_RESETVALUE               _UINT32_(0x00)                                       /*  (FUSES_FBCFG0) NVR BCFG User Configuration Area  Reset Value */

